# Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в отдельной строке.

# Формат входных данных
# На вход программе подаётся три целых числа, каждое на отдельной строке.

# Формат выходных данных
# Программа должна вывести сумму введенных чисел.

# Тестовые данные 🟢
# Sample Input 1:

# 9
# 11
# 2
# Sample Output 1:

# 22

# put your python code here
a = int(input())
b = int(input())
c = int(input()) 
x = (a + b + c)
print(x)
